[
    {
        "bookId": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "/public/BookImg/the-silent-patient.png",
        "review": "The Silent Patient by Alex Michaelides is a gripping psychological thriller that keeps readers on the edge of their seats from start to finish. The story revolves around Alicia Berenson, a famous painter who suddenly stops speaking after being accused of murdering her husband. The narrative unfolds through the perspective of Theo Faber, a psychotherapist determined to unravel Alicia's silence and uncover the truth behind the crime.\n\nMichaelides masterfully weaves together a tale of deception, obsession, and the complexities of the human psyche.",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Mystery",
        "tags": ["Suspense", "Psychological"],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
      },
      {
        "bookId": 2,
        "bookName": "Educated",
        "author": "Tara Westover",
        "image": "/public/BookImg/educated.png",
        "review": "Educated by Tara Westover is a remarkable memoir that chronicles the author's journey from growing up in a strict, isolated household in rural Idaho to eventually earning a PhD from Cambridge University. Westover's writing is raw, honest, and deeply affecting, offering readers a rare glimpse into the transformative power of education.\n\nFrom a young age, Westover's life was defined by her family's radical beliefs and her father's paranoia about government intervention. Denied access to formal schooling, she and her siblings were instead subjected to grueling labor and taught to fear the outside world. ",
        "totalPages": 400,
        "rating": 4.7,
        "category": "Biography",
        "tags": ["Memoir", "Education"],
        "publisher": "Random House",
        "yearOfPublishing": 2018
      },
      {
        "bookId": 3,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "/public/BookImg/night-circus.jpeg",
        "review": "The Night Circus by Erin Morgenstern is a mesmerizing tale of magic, love, and the power of imagination. Set in the late 19th century, the novel follows the rivalry between two young magicians, Celia and Marco, who are bound by a mysterious competition orchestrated by their enigmatic mentors.\n\nAt the heart of the story is Le Cirque des Rêves, a circus that arrives without warning and is only open at night. As Celia and Marco manipulate the circus's enchantments to showcase their magical prowess, they unwittingly fall in love, defying the rules of their competition and risking everything for a chance at happiness.",
        "totalPages": 387,
        "rating": 4.3,
        "category": "Fantasy",
        "tags": ["Magic", "Romance"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
      },
      {
        "bookId": 4,
        "bookName": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "image": "/public/BookImg/where-the-crawdads-sing.png",
        "review": "Where the Crawdads Sing by Delia Owens is a beautifully written novel that transports readers to the marshes of North Carolina, where secrets lurk beneath the surface and nature reigns supreme. The story follows Kya Clark, a young girl who grows up isolated from society in the marsh, earning her the nickname 'Marsh Girl.'\n\nAs Kya navigates the challenges of survival and loneliness, she forms unlikely connections with the people of Barkley Cove, including the charming Tate Walker and the enigmatic Chase Andrews.",
        "totalPages": 384,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Nature", "Coming of Age"],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
      },
      {
        "bookId": 5,
        "bookName": "The Subtle Art of Not Giving a F*ck",
        "author": "Mark Manson",
        "image": "/public/BookImg/books-subtle-art.png",
        "review": "The Subtle Art of Not Giving a F*ck by Mark Manson is a refreshing and unconventional self-help book that challenges conventional wisdom and encourages readers to embrace life's uncertainties. Unlike typical self-help guides that preach positivity and endless optimism, Manson advocates for a more pragmatic approach, arguing that happiness comes not from avoiding problems, but from confronting them head-on.\n\nThrough a combination of personal anecdotes, psychological research, and irreverent humor, Manson delivers a powerful message about the importance of values and priorities.",
        "totalPages": 224,
        "rating": 4.2,
        "category": "Self-Help",
        "tags": ["Motivation", "Philosophy"],
        "publisher": "HarperOne",
        "yearOfPublishing": 2016
      },
      {
        "bookId": 6,
        "bookName": "Sapiens: A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "image": "/public/BookImg/Sapiens.png",
        "review": "Sapiens: A Brief History of Humankind by Yuval Noah Harari is a thought-provoking exploration of the history of our species, from the emergence of Homo sapiens in Africa to the present day. Harari takes readers on a sweeping journey through time, examining the key events and developments that have shaped human civilization.\n\nAt the heart of the book is Harari's thesis that Homo sapiens' ability to cooperate and communicate through language has been the driving force behind our success as a species. ",
        "totalPages": 443,
        "rating": 4.8,
        "category": "History",
        "tags": ["Anthropology", "Evolution"],
        "publisher": "Harper",
        "yearOfPublishing": 2014
      }
]